In [2]:
# importação da bilioteca
import pandas as pd

In [3]:
# importação da base de dados
url_dados = 'https://raw.githubusercontent.com/alura-cursos/pandas-conhecendo-a-biblioteca/main/desafios/alunos.csv'
dados = pd.read_csv(url_dados, delimiter=',')

In [4]:
# mostra as 7 primeiras linhas do df
dados.head(7)

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    NaN     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True
5  Bruna     23    NaN     False
6   Dara     21    7.0      True

In [5]:
# mostra as 5 últimas linhas do df
dados.tail(5)

      Nome  Idade  Notas  Aprovado
13   Mirla     25    9.0      True
14   Paulo     37    NaN     False
15  Mylena     29    7.0      True
16   Lucas     33    NaN     False
17   Nadia     34    8.0      True

In [6]:
# mostra a quantidade de linhas e colunas do df
dados.shape

(18, 4)

In [7]:
# a função describe traz alguns dados básicos do df
dados.describe()

           Idade      Notas
count  18.000000  12.000000
mean   25.500000   6.800000
std     6.070662   2.204953
min    18.000000   2.500000
25%    21.000000   5.450000
50%    24.500000   7.000000
75%    28.750000   8.250000
max    37.000000  10.000000

In [8]:
# média da idade dos alunos
medida_idade = dados['Idade'].mean(numeric_only=True)

In [9]:
# média das notas dos alunos
media_notas = dados['Notas'].mean(numeric_only=True)

In [10]:
# desvio padrao da Idade
desvio_padrao_idade = dados['Idade'].std()
desvio_padrao_idade

6.070662334249088

In [ ]:
# desvio padrao das Notas
desvio_padrao_notas = dados['Notas'].std()
desvio_padrao_notas

2.204953101954366

1) Verifique se a base de dados possui dados nulos e, caso tenha, realize o tratamento desses dados nulos da forma que achar mais coerente com a situação.

In [ ]:
dados.isnull().sum()

Nome        0
Idade       0
Notas       6
Aprovado    0
dtype: int64

In [13]:
dados.fillna(0, inplace=True)

In [14]:
dados.isnull().sum()

Nome        0
Idade       0
Notas       0
Aprovado    0
dtype: int64

2) Os alunos "Alice" e "Carlos", não fazem mais parte da turma. Sendo assim, remova-os da base de dados.

In [15]:
dados.columns

Index(['Nome', 'Idade', 'Notas', 'Aprovado'], dtype='object')

In [18]:
dados.query('Nome == "Alice" | Nome == "Carlos"')

     Nome  Idade  Notas  Aprovado
7  Carlos     19    6.0      True
8   Alice     35    5.6     False

In [21]:
dados.query('Nome == "Alice" | Nome == "Carlos"').index

Index([7, 8], dtype='int64')

In [20]:
alunos_a_remover = dados.query('Nome == "Alice" | Nome == "Carlos"').index

In [22]:
dados.drop(alunos_a_remover, inplace=True)

In [24]:
dados.query('Nome == "Alice" | Nome == "Carlos"')

Empty DataFrame
Columns: [Nome, Idade, Notas, Aprovado]
Index: []

In [25]:
dados.head()

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    0.0     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True

3) Aplique um filtro que selecione apenas os alunos que foram aprovados.

In [26]:
dados.head()

    Nome  Idade  Notas  Aprovado
0    Ary     20    7.5      True
1    Ana     18    0.0     False
2  Cátia     27    2.5     False
3  Denis     18    5.0     False
4   Beto     21   10.0      True

In [31]:
alunos_aprovados = dados['Aprovado'] == True

In [35]:
dados[alunos_aprovados]

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    7.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True
15     Mylena     29    7.0      True
17      Nadia     34    8.0      True

In [37]:
alunos_aprovados = dados[alunos_aprovados]

In [39]:
alunos_aprovados['Aprovado'].unique()

array([ True])

4) Salve o DataFrame que possui apenas os alunos aprovados em um arquivo csv chamado "alunos_aprovados.csv".

In [40]:
alunos_aprovados.to_csv('alunos_aprovados.csv')

Extra: Ao conferir as notas dos alunos aprovados, notamos que algumas notas estavam incorretas. As alunas que tiraram nota 7.0, na verdade, tinham um ponto extra que não foi contabilizado. Sendo assim, substitua as notas 7.0 da base de dados por 8.0. Dica: pesquise pelo método replace.

In [42]:
alunos_aprovados.query('Notas == 7.0')

      Nome  Idade  Notas  Aprovado
6     Dara     21    7.0      True
15  Mylena     29    7.0      True

In [43]:
alunos_aprovados.replace({'Notas': 7.0}, 8.0, inplace=True)

C:\Users\gabri\AppData\Local\Temp\ipykernel_15256\522902555.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  alunos_aprovados.replace({'Notas': 7.0}, 8.0, inplace=True)

In [44]:
alunos_aprovados.head()

         Nome  Idade  Notas  Aprovado
0         Ary     20    7.5      True
4        Beto     21   10.0      True
6        Dara     21    8.0      True
12  Sthefanie     26    9.5      True
13      Mirla     25    9.0      True

In [47]:
alunos_aprovados.to_csv('alunos_aprovados.csv', index=False)

In [48]:
pd.read_csv('alunos_aprovados.csv')

        Nome  Idade  Notas  Aprovado
0        Ary     20    7.5      True
1       Beto     21   10.0      True
2       Dara     21    8.0      True
3  Sthefanie     26    9.5      True
4      Mirla     25    9.0      True
5     Mylena     29    8.0      True
6      Nadia     34    8.0      True